/*02-3. 逆序的三位数(10)
时间限制
400 ms
内存限制
65536 kB
代码长度限制
8000 B
判题程序
Standard
作者
翁恺（浙江大学）
程序每次读入一个正3位数，然后输出按位逆序的数字。注意：当输入的数字含有结尾的0时，输出不应带有前导的0。比如输入700，输出应该是7。

输入格式：

每个测试是一个3位的正整数。

输出格式：

输出按位逆序的数。


————————————————
版权声明：本文为CSDN博主「coderstory」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
原文链接：https://blog.csdn.net/fjinhao/article/details/46853171*/
#include<stdio.h>

int main(void)
{   int a=0,x,y,z;
    scanf("%d",&a);
   // printf("%d\n",a);
    x=a/100;
    y=a%100/10;
    z=a%10;
   
    printf("%d\n",z*100+y*10+x);

}
